<html>
    <head>
        <meta charset = "utf-8">
        <meta name="viewport" content="width=device-width, initial-scale=1.0">
        <title>Домашние задания: 8 класс</title>
    </head>
    <body>
        <p><b>Домашние задания: 8 класс</b></p>
        <p>---------------------------------------------------</p>
        <p><i>Примечание: дата д/з указывает день, в который д/з было выдано на уроке. На 1 урок выдается 1 д/з. Если выложено какое-то новое д/з, то оно идет на следующий урок.</i></p>
        <p><i>Все решения в тетради писать полностью, без полного решения оценка не выставляется.</i></p>
        <p>---------------------------------------------------</p>
        <p><u>2022-09-20</u></p>
        <p>• Расписать таблицу истинности для формулы f = A ⊕ (A ↓ B)</p>
        <p>• <a href = "c++.html">С++ базовый</a> : составить программу(и записать в тетрадь), которая:</p>
        <p>  1) объявляет целую переменную n</p>
        <p>  2) вводит ее с клавиатуры</p>
        <p>  3) если n делится без остатка на 7 и на 3 одновременно и при этом n четно, то выводит на экран сообщение "n has many dividers though"</p>
        <p>  4) в противном случае (если предыдущее условие не выполняется) выводит на экран сообщение "good number enough"</p>
        <p>---------------------------------------------------</p>
        <p><u>2022-09-20</u></p>
        <p>• Расписать таблицу истинности для формулы f = A → (A ∨ B)</p>
        <p>• <a href = "c++.html">С++ базовый</a> : составить программу, проверяющую, что сумма цифр числа больше 10. Если сумма цифр более 10, нужно вывести YES (с помощью команды cout<<"YES"), в противном случае - NO(с помощью команды cout<<"NO"). Число вводить как строку через gets, как было в классе. Программу переписать в тетрадь.</p>
        <p></p>
        <p></p>
        <p>---------------------------------------------------</p>
        <p><u>2022-09-15</u></p>
        <p>• Расписать таблицу истинности для формулы f = A ⊕ (¬B)</p>
        <p>• Составить программу (python), выводящую на экран все трехзначные числа, у которых первая цифра равна последней (третьей) цифре.</p>
        <p>• <a href = "c++.html">С++ базовый</a> : составить программу, проверяющую принадлежность точки отрезку на прямой - на вход программе подается три целых числа x, a, b, где x - точка, a - начало отрезка, b - конец отрезка (a <= b).
        <p></p>
        <p></p>
        <p>---------------------------------------------------</p>
        <p><u>2022-09-13</u></p>
        <p>• Расписать таблицу истинности для формулы f = ¬(A ∨ (¬B))</p>
        <p>• Составить программу на питоне, выводящую на экран числа из отрезка [99;999], кратные 41 и при этом не кратные 3.</p>
        <p>• Дано изображение размером 1400x960. Сколько цветов в палитре изображения, если его объем равен 2352000 байт?</p>
        <p><i>Примечание: все решения в тетради писать полностью, без полного решения оценка не выставляется.</i></p>
        <p></p>
        <p></p>
        <p>---------------------------------------------------</p>
        <p><u>2022-09-09</u></p>
        <p>Решить 1 пример (1б), ссылка: <a href = "binsum(4-6bit).html">Сумма двоичных чисел (4-6 бит)</a></p>
        <p>Решить 1 пример (2б), ссылка: <a href = "powersof2(4-6bit).html">Разложение двоичного числа по степеням (4-6 бит)</a></p>
        <p>Перевести число 124 из восьмеричной в десятичную систему счисления.</p>
        <p>Перевести число 119 из  десятичной в восьмеричную систему счисления.</p>
        <p>Расписать таблицы истинности для формул:
        <p>• A ∨ (¬A)</p>
        <p>• A & (¬A)</p>
        <p>• A ∨ 0</p>
        <p>• A & 0</p>
        <p>• A ∨ 1</p>
        <p>• A & 1</p>
        <p>• (A & (¬B)) ∨ A</p>
        <p><i>Примечание: все решения в тетради писать полностью, без полного решения оценка не выставляется.</i></p>
        <p>---------------------------------------------------</p>
        <p><u>2022-09-06</u></p>
        <p>Перевести числа из одной системы счисления в другую:</p>
        <p>• 1001<sub>2</sub> = (?)<sub>10</sub></p>
        <p>• 1,101<sub>2</sub> = (?)<sub>10</sub></p>
        <p>• 53<sub>10</sub> = (?)<sub>2</sub></p>
        <p>• 7,125<sub>10</sub> = (?)<sub>2</sub></p>
        <p>• 41<sub>8</sub> = (?)<sub>10</sub></p>
        <p>• 1,2<sub>8</sub> = (?)<sub>10</sub></p>
        <p>• 123<sub>10</sub> = (?)<sub>8</sub></p>
        <p>• 0,625<sub>10</sub> = (?)<sub>8</sub></p>
        <p>• 1B,1<sub>16</sub> = (?)<sub>10</sub></p>
        <p>• 19,0625<sub>10</sub> = (?)<sub>16</sub></p>
        <p><i>Примечание: малый индекс означает основание системы счисления, в которой записано число.</i></p>
        <p><i>Примечание: все решения в тетради писать полностью, без полного решения оценка не выставляется.</i></p>
        <p>---------------------------------------------------</p>
        <p><u>2022-09-02</u></p>
        <p>3 примера (1а), ссылка: <a href = "binsum(3-5bit).html">Сумма двоичных чисел (3-5 бит)</a></p>
        <p>3 примера (2а), ссылка: <a href = "powersof2(3-5bit).html">Разложение двоичного числа по степеням (3-5 бит)</a></p>
        <p>Примечание: решить примеры, проверить (нажав кнопку "Проверить"), переписать решение в тетрадь (полностью), без полного решения оценка не выставляется.</p>
        <p>Примеры генерируются автоматически - после того, как решите очередной, просто обновите страницу, чтобы сгенерировать новый.</p>
        <p></p>
        <p>---------------------------------------------------</p>
        <p><a href = "index.html">Меню</a></p>
    </body>
</html>
